In [2]:
import pandas as pd

# **Task 1**

In [3]:
data_movies = pd.read_csv('movies.csv')
data_movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [4]:
data_ratings = pd.read_csv('ratings.csv')
data_ratings_5 = data_ratings[data_ratings.rating == 5.0]
data_ratings_5.head(10)

    userId  movieId  rating  timestamp
3        1       47     5.0  964983815
4        1       50     5.0  964982931
6        1      101     5.0  964980868
8        1      151     5.0  964984041
9        1      157     5.0  964984100
10       1      163     5.0  964983650
11       1      216     5.0  964981208
13       1      231     5.0  964981179
15       1      260     5.0  964981680
18       1      333     5.0  964981179

In [5]:
data_ratings_5['movieId'].value_counts(normalize=False).head(1)

318    153
Name: movieId, dtype: int64

In [6]:
mer_data = data_ratings_5.merge(data_movies, left_on='movieId', right_on='movieId', suffixes=('_left', '_right'))
# mer_data.head()
# mer_data['title'].value_counts(normalize=False).head(1)
mer_data['title'].value_counts(normalize=False).index.values[0]

'Shawshank Redemption, The (1994)'

# Подскажите пожалуйста, как по индексу вытащить значение title? Чтобы был не объект как наверху, а именно строка

# **Task 2**

In [7]:
# По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) 
# категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [8]:
power_ = pd.read_csv('power.csv')
power_.head(10)

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1
5  Belgium  2011      25.0         1
6  Belgium  2010      22.0         1
7  Belgium  2009      45.0         1
8  Czechia  1998       1.0         1
9  Czechia  1995       7.0         1

In [14]:
power_baltic = power_[ (power_.country == 'Latvia') | (power_.country == 'Lithuania' )  |  (power_.country =='Estonia') ]
# альтернативный вариант с .ISIN
power_['country'].isin(['Latvia', 'Estonia', 'Lithuania'])
power_baltic_05_10 = power_baltic.query ('2005 <= year <= 2010')

# power_baltic_05_10['year'].unique()
# power_baltic_05_10 ['country'].unique()

In [10]:
res = power_baltic_05_10[power_baltic_05_10.quantity > 0]
res['quantity'].sum()

26034247.620774537

# Подскажите пожалуйста, как можно оптимизировать эту задачу, написать ее короче, сделать pipeline. Заранее спасибо

# **Task 3**

In [11]:
page_url = 'https://www.finanz.ru/valyuty/usd-rub'

In [12]:

import urllib.request
import ssl

ssl._create_default_https_context = ssl._create_unverified_context
response = urllib.request.urlopen('https://www.python.org')
# print(response.read().decode('utf-8'))

In [13]:
pandas_df = pd.read_html(page_url,  encoding='utf-8')
pandas_df[0]

,0,1,2,3,4,5,6,7,8,9,10,11
0,ММВБ,4 264,"-0,4%",Nasdaq,14 466,"-0,1%",Биткойн,56 328,"0,5%",USD/RUB,718245,"0,0%"
1,РТС,1 870,"-0,7%",S&P500,4 351,"-0,2%",Нефть,829,"-0,6%",EUR/RUB,829740,"0,2%"
2,Dow,34 378,"-0,3%",FTSE100,7 130,"-0,2%",Золото,1 760,"0,0%",EUR/USD,11551,"0,2%"

# Подскажите, в чем смысл последнего задания? может я что то не понял, или оно действительно слишком легкое?